In [3]:
import pandas as pd
import numpy as np
import pyodbc
import seaborn as sns
import matplotlib.pyplot as plt
from sqlalchemy import create_engine

In [4]:
svr_name = 'KU1ICDDWV011.kunet.ae'
db_name = 'CACM'
u_name = 'cacm_user'
u_pass = 'Welcome#123'

In [5]:
eng = create_engine("mssql+pyodbc://"+u_name+":"+u_pass+"@"+svr_name+"/"+db_name+"?driver=ODBC+Driver+17+for+SQL+Server")

In [6]:
query_payroll = "select * from ADERP.dbo.KU_Payroll_All"
query_education ="select * from ADERP.dbo.XXDOF_BI_KU_EDUCATION_T"
query_basic_info = "select * from ADERP.dbo.XXDOF_BI_KU_Emp_Basic_Info_T"
query_payroll_T =  "select * from ADERP.dbo.XXDOF_BI_KU_PAYROLL_T"

In [7]:
payroll = pd.read_sql(query_payroll, eng)
education = pd.read_sql(query_education, eng)
info = pd.read_sql(query_basic_info, eng)
payroll_t = pd.read_sql(query_payroll_T, eng)

In [8]:
child = education[['EMPLOYEE_NUMBER','CHILD_NAME']].drop_duplicates()
eligible = education[['EMPLOYEE_NUMBER','MAX_CHILD_ELIGIBLE']].drop_duplicates()
emp = info[['EMPLOYEENUMBER','NATIONALITY','MARITALSTAT']].drop_duplicates()

In [22]:
education['ACADEMIC_YEAR'].unique()

array(['2013 - 2014', '2017 - 2018', '2014 - 2015', '2012 - 2013',
       '2015 - 2016', '2011 - 2012', '2016 - 2017', '2021 - 2022',
       '2020 – 2021', '2019 – 2020', '2018 – 2019', '2022 – 2023',
       '2001 - 2002'], dtype=object)

In [9]:
def academic_year(year):
    
    academic = education[education['ACADEMIC_YEAR'] == year]
    academic = academic.astype({'AMOUNT_TO_BE_PAID':'float'})
    
    ed_final = academic[['EMPLOYEE_NUMBER','ACADEMIC_YEAR','ACADEMIC_SEM','CHILD_NAME','DATE_OF_BIRTH','TOTAL_ENTITLEMENT','CHILD_ENTITLEMENT_AMOUNT','SCHOOL','AMOUNT_TO_BE_PAID']]
    
    return ed_final

In [10]:
def paid(Emp):
    
    result = ed_final[ed_final['EMPLOYEE_NUMBER'] == Emp ].agg({'AMOUNT_TO_BE_PAID':'sum'})
    
    return list(result)

In [28]:
ed_final = academic_year('2020 – 2021')

In [29]:
sc = pd.read_excel('Schools_list.xlsx')

mylist = sc['EMPLOYEE_NUMBER'].tolist()


output = []

for emp in mylist:
    output.append(paid(emp))

In [30]:
df = pd.DataFrame(output)

In [31]:
df

           0
0   60000.00
1   27405.00
2   30000.00
3   31071.00
4   51123.00
5   45375.15
6   36010.50
7   80000.00
8   80000.00
9   80000.00
10  80000.00
11  80000.00
12  80000.00
13  35058.00
14  45206.00
15  56000.00
16  37735.50
17  60000.00
18  60000.00
19      0.00
20  57920.00
21  14040.00
22  80000.00
23      0.00
24      0.00